Repository: TuitionScheduler/matrical
Catalog: matrical/lib/l10n/app_*.arb
Languages: es

source: Add Courses
es: Añadir Cursos

# addCoursesPriorToGeneratingSchedules
source: Add courses before generating.
es: Añade cursos antes de generar.

# addCoursesToShare
source: Add courses to be able to share the link.
es: Añade cursos para poder compartir el enlace.

source: Afternoon
es: Tarde

source: Any
es: Cualquiera

source: Apply
es: Aplicar

source: By Agreement
es: Por Acuerdo

source: By Agreement
es: Por Acuerdo

source: By Name
es: Por Nombre

source: Calendar
es: Calendario

# calendarHelp
source: Calendar: Creates and opens a .ics file with your schedule. ICS files can be opened by Google Calendar, Outlook, etc. to register the schedule in your app of choice.
es: Calendario: Crea y abre un archivo ".ics" con tu horario. Los archivos ".ics" pueden ser abiertos por Google Calendar, Outlook, etc. para añadir tus clases a tu calendario.

source: Cancel
es: Cancelar

# classroomSingleOrPlural
source: Classroom(s)
es: Salon(es)

source: Close
es: Cerrar

source: Code
es: Texto

# codeHelp
source: Code: Lets you send a code that other users can copy to import your schedule by pasting the code in the Saved Schedules page.
es: Código: Te permite enviar un código con las secciones en este horario. Otros usuarios pueden copiar el código e importarlo en la aplicación mediante la página de Selección de Cursos o la de Horarios Guardados.

# corequisitesWithInput
source: Co-requisites: {corequisites}
es: Co-requisitos: {corequisites}

# couldNotFindValidSchedules
source: Couldn't find schedules with your courses and preferences.
es: No encontramos horarios válidos con tus cursos y preferencias.

source: Course
es: Curso

# courseAutocompleteError
source: Error suggesting courses.
es: Error sugiriendo cursos.

# courseDoesNotExist
source: Course {courseCode} does not exist.
es: Curso {courseCode} no existe.

# courseFiltersExplanation
source: Course filters limit which sections are used for schedule generation.
es: Los filtros de cursos limitan qué secciones se utilizan para la generación de horarios.

# courseNotAvailable
source: Course not available for this semester according to our database.
es: Curso no disponible para este semestre según nuestra base de datos.

# courseNotInLocalMemory
source: Could not find the course in local memory. Try again once connected to the Internet.
es: No se pudo encontrar el curso en la memoria local. Intente otra vez una vez esté conectado al Internet.

source: Course Search
es: Búsqueda de Cursos

# courseSearchIcon
source: Courses
es: Cursos

# courseSearchInput
source: Search Course or Department
es: Buscar Curso o Departamento

# courseSelect
source: Course Selection
es: Selección de Cursos

# courseSelectIcon
source: Create
es: Crear

source: Courses in schedule:
es: Cursos en horario:

# creditsWithInput
source: Credits: {credits}
es: Créditos: {credits}

source: Delete Filters
es: Borrar Filtros

source: Dense
es: Denso

# departmentAutoCompleteError
source: Error suggesting departments.
es: Error sugiriendo departamentos.

source: Dismiss
es: Ocultar

# divisionGraduate
source: Graduate
es: Graduado

# divisionLower
source: Undergraduate
es: Subgraduado

# divisionUpper
source: Undergraduate or Graduate
es: Subgraduado o Graduado

source: Edit
es: Editar

source: Ends Before
es: Acaba Antes de

source: Excluded Professors:
es: Profesores Excluidos:

source: Excluded Sections:
es: Secciones Excluidas:

source: Export
es: Exportar

source: Export as:
es: Exportar como:

# failedToSaveImage
source: Image couldn't be saved.
es: Imagen no pudo ser guardada.

source: Filters
es: Filtros

# friday
source: F
es: V

source: Generated Schedules
es: Horarios Generados

# generateSchedulesButton
source: Generate Schedules
es: Generar Matrículas

# generateSchedulesIcon
source: Generate
es: Generar

# hasIntegratedLab
source: Course Includes Lab: {hasIntegratedLab}
es: Tiene Laboratorio Integrado: {hasIntegratedLab}

source: Hybrid
es: Híbrido

source: Image
es: Imagen

# imageHelp
source: Image: Saves an image of the schedule on your device.
es: Imagen: Guarda una imagen del horario en la galería de tu dispositivo.

source: Import
es: Importar

# importDialogDescription
source: If someone sends you a schedule code, you can paste it in this text input to import it. You can export schedule codes using the "Text" option when you press "Export" on a generated or saved schedule.
es: Si te envían un código de horario, puedes copiarlo en esta entrada de texto para importarlo. Puedes exportar códigos de horario la opción de "Texto" cuando presionas "Exportar" en un horario generado o guardado.

# importScheduleDialog
source: Import Schedule
es: Importar horario

source: In-person
es: Presencial

# invalidCode
source: Entered code has an invalid format
es: El código entrado tiene un formato inválido.

# invalidCodeError
source: Invalid code couldn't be imported.
es: Código inválido no pudo ser importado.

# invalidCourseFormat
source: Course does not have the expected format (DEPT####).
es: Curso no tiene el formato esperado (DEPT####).

# invalidSectionFormat
source: Section does not have the expected format.
es: Sección no tiene el formato esperado.

# leastRecent
source: Oldest
es: Menos Reciente

# levelInput
source: Level: {level}
es: Nivel: {level}

source: Link
es: Enlace

# linkHelp
source: Link: Generate a link that other users can access to view your schedule.
es: Enlace: Genera un enlace que otros usuarios pueden acceder para ver el horario.

# meetings
source: Meetings: {meetings}
es: Reuniones: {meetings}

source: Modality
es: Modalidad

# monday
source: M
es: L

source: Morning
es: Mañana

# mostRecent
source: Newest
es: Más Reciente

# noExcludedProfessor
source: No professor has been excluded
es: Ningún profesor ha sido excluido

# noExcludedSection
source: No course section has been excluded
es: Ninguna sección ha sido excluida

source: Noon
es: Mediodía

source: No Preference
es: Sin Preferencia

source: Options
es: Opciones

source: or
es: o

source: Order By
es: Orden

# preferencesHelpExcludedProfessors
source: Excluded Professors - View what professors you've chosen to avoid in your sections. In the popup, pressing the '+' button beside a professor's name will remove them from the exclusion list.
es: Profesores Excluídos - Ver y/o incluír de vuelta profesores.

# preferencesHelpExcludedSections
source: Excluded Professors - View what sections you've excluded from the generated schedules. In the popup, pressing the '+' button beside a section will remove it from the exclusion list.
es: Secciones Excluidas - Ver y/o incluír de vuelta secciones.

# preferencesHelpModality
source: In-person / By Agreement (Remote) - Preferred Modality.
es: Presencial / Por Acuerdo - Modalidad preferida.

# preferencesHelpOverview
source: Here you can control what schedules are shown first based on your preferences.
es: Aquí puedes controlar cuales horarios serán mostrados primeros basados en tus preferencias.

# preferencesHelpProfessorRanking
source: Professor Ranking - Order professors based on your preferences to prioritize sections with your desired professors. You can tap on a course within the professor ranking popup to enable rankings for that course.
es: Ranking de Profesores - Ordena profesores basado en tus gustos. Presiona en un curso para activar ranking de ese curso.

# preferencesHelpSparseDense
source: Sparse / Dense - Determines if the sections in the schedule should have free time in between them. The densest schedule is one where all your courses are packed into the fewest number of days with the lowest amount of free time between classes.
es: Esparcido / Denso - Controla si las secciones deben tener espacio entremedio o no.

# preferencesHelpTime
source: Preferred Times - Choose when you want to take courses during the day.
es: Tiempo Preferido para Cursos - Selecciona cuándo tomar los cursos durante el día.

source: Preferred Course Times
es: Tiempo Preferido para Cursos

# prerequisitesWithInput
source: Prerequisites: {prerequisites}
es: Pre-requisitos: {prerequisites}

# profesorsSingleOrPlural
source: Professor(s)
es: Profesor(es)

source: Professor Ranking:
es: Ranking de Profesores:

source: Professors:
es: Profesores:

# remoteAsynchronous
source: Asynchronous Remote
es: Remoto Asincrónico

# remoteSynchronous
source: Synchronous Remote
es: Remoto Sincrónico

# removedCoursesWarning
source: Some courses and/or sections do not belong to this term and/or year.
es: Algunos cursos y/o secciones no pertenecen a este término y/o año.

# requiredCourseInput
source: Course*
es: Curso*

source: Save
es: Guardar

# savedSchedules
source: My Schedules
es: Mis Horarios

# savedSchedulesIcon
source: My Schedules
es: Mis Horarios

source: Save Filters
es: Guardar Filtros

# saveScheduleAlreadyExists
source: This name is already in use.
es: Horario con este nombre ya existe.

# saveScheduleDialog
source: Save Schedule
es: Guardar Horario

# saveScheduleEmptyName
source: Schedule must have a name.
es: Horario debe tener un nombre.

# saveScheduleFailedWrite
source: There was a problem saving the schedule. Try again.
es: Hubo un problema guardando el horario. Intente otra vez.

# saveScheduleHitLimit
source: Schedule limit reached (300). Delete some schedules.
es: Límite de horarios alcanzado (300). Borra algunos horarios.

# saveScheduleSuccess
source: Schedule saved successfully!
es: Horario guardado exitosamente!

# savingImage
source: Generating and saving image...
es: Generando y guardando imagen...

source: Schedule
es: Horario

# scheduleCopiedToClipboard
source: Link with your schedule copied to your device.
es: Enlace con tu horario copiado a tu dispositivo.

source: Schedule Filters
es: Filtros de Horario

# scheduleFiltersDescription
source: Upon activating them, you can limit the times and days for the classes.
es: Al activarlos, puedes limitar el rango de horas y días donde quieres tener clase.

# scheduleLinkCopiedToClipboard
source: Link with your courses was copied to your device.
es: Enlace con tus cursos fue copiado a tu dispositivo.

# scheduleNameInput
source: Schedule Name
es: Nombre de Horario

source: Schedule Preferences
es: Preferencias de Horario

# scheduleSavedSuccessfully
source: Schedule was saved successfully.
es: Horario guardado exitosamente.

# scheduleViewWithInput
source: Schedule View ({scheduleName})
es: Vista de Horario ({scheduleName})

source: Section
es: Sección

# sectionAutocompleteError
source: Error suggesting sections.
es: Error sugiriendo secciones.

# sectionNotAvailable
source: Section not available for this semester according to our database.
es: Sección no disponible para este semestre según nuestra base de datos.

# sectionNotInLocalMemory
source: Could not find that section for the course in local memory. Try again once connected to the Internet.
es: No se pudo encontrar esa sección para el curso en la memoria local. Intente otra vez una vez esté conectado al Internet.

# sectionWithInput
source: Section: {section}
es: Sección: {section}

source: Sparse
es: Esparcido

source: Starts After
es: Comienza Después de

source: Successfully imported schedule.
es: Horario importado exitosamente.

# successfullySavedImage
source: Image saved successfully!
es: Imagen guardada exitosamente!

source: Term
es: Término

# termExtendedSummer
source: Extended Summer
es: Verano Extendido

# termFall
source: Fall Semester
es: Primer Semestre

# termFirstSummer
source: First Summer
es: Primer Verano

# termSecondSummer
source: Second Summer
es: Segundo Verano

# termSpring
source: Spring Semester
es: Segundo Semestre

# thursday
source: Th
es: J

# totalCredits
source: Total Credits: {totalCredits}
es: Total de Créditos: {totalCredits}

# tuesday
source: T
es: M

source: Validate
es: Validar

source: View
es: Vista

source: View in Week
es: Ver en Semana

source: Year
es: Año
